Конфигурация/InformationRegisters/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияРегистрации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/гкс_НастройкаПорядкаСостоянийРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>гкс_НастройкаПорядкаСостоянийРегистрации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокСостояний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПорядокСостоянийРегистрации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/гкс_СостоянияРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесПринят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесНеПринят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятоПоПревышениюМаксимальногоВеса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтборуПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыПробПолучены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоНеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаРазрешена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Убыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрибылАвторизован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВесахБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятыПробыАвторизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгрузкаРазрешенаАвторизован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженАвторизован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВесахТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогрузкаРазрешена</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погрузка</Name>
					<Comment>гкс+ [ERP-2178]</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погружен</Name>
					<Comment>ERP-2029</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/гкс_РегистрацияНаПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>гкс_РегистрацияНаПЛК</Name>
			<BasedOn>
				<xr:Item>Document.гкс_ВъездНаКПП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.гкс_СДИЗНаПЛК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПолучатель</Name>
					<Comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внутригрупповой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаВъезда</Name>
					<Comment>Точка маршрута для определения проезда</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ИДРейса</Name>
					<Comment>ERP-2176</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияВеса</Name>
					<Comment>Ед.измерения веса в документе</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗоныКарантинногоКонтроля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗоныКарантинногоКонтроляСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесоваяВъезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПроезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаОтгрузкуПродукции</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузкаСОдногоБорта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ВъездНаКПП</v8:Type>
						<v8:Type>cfg:DocumentRef.гкс_СРПВПрибытиеНаПуть</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СДИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СДИЗЗЕРНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/гкс_СостоянияРегистрации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(СтруктураЗаписи) Экспорт
	
    ОбменДаннымиСлужебный.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "гкс_СостоянияРегистрации");
	
КонецПроцедуры

// Делает запись в регистр сведений о новом состоянии регистрации
//
// Параметры:
//  ДанныеЗаписи  - Структура - данные для записи в регистр
// 
Процедура УстановитьСостояниеРегистрации(ДанныеЗаписи) Экспорт
	
	ДобавитьЗапись(ДанныеЗаписи);
	
	гкс_ПриемкаТранспортаВызовСервера.
		РассчитатьДанныеРегистрацииДляРМПриемкаТранспорта(ДанныеЗаписи.ДокументРегистрации);
		
КонецПроцедуры

// Возвращает структуру записи
//
// Возвращаемое значение:
//  Структура - структура записи.
//
Функция СтруктураЗаписи() Экспорт
    
    СтруктураЗаписи = Новый Структура;
	
	СтруктураЗаписи.Вставить("Период");
	СтруктураЗаписи.Вставить("ТочкаМаршрута");
	СтруктураЗаписи.Вставить("ТипРегистрации");
	СтруктураЗаписи.Вставить("ДокументРегистрации");
	СтруктураЗаписи.Вставить("ТранспортноеСредство");
    СтруктураЗаписи.Вставить("ВидПеревозки");
     
    СтруктураЗаписи.Вставить("Состояние");
    СтруктураЗаписи.Вставить("Пользователь");
    СтруктураЗаписи.Вставить("Комментарий");
    СтруктураЗаписи.Вставить("МестнаяДата");

    Возврат СтруктураЗаписи;
    
КонецФункции

// Проверяет что у документа достигнуто финальное состояние "Убыл"
//
// Возвращаемое значение:
//		Булево - Истина, если текущее состояние "Убыл"
//
Функция УжеУбыл(ДокументРегистрации) Экспорт
	
	ТекущееСостояние = ТекущееСостояниеПоРегистрации(ДокументРегистрации);
	
	Возврат ТекущееСостояние = Перечисления.гкс_СостоянияРегистрации.Убыл;
			
КонецФункции

// Возвращает текущее состояние регистрации
//
// Параметры:
//  ВидПеревозки - ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - вид перевозки.
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - регистрация на ПЛК.
//  ТипРегистрации - ПеречислениеСсылка.гкс_ТипРегистрации - тип регистрации.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_СостоянияРегистрации - текущее состояние регистрации.
//
Функция ТекущееСостояниеРегистрации(ВидПеревозки, ДокументРегистрации, ТипРегистрации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СостоянияРегистрацииСрез.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(
	|			,
	|			ВидПеревозки = &ВидПеревозки
	|				И ТипРегистрации = &ТипРегистрации
	|				И ДокументРегистрации = &ДокументРегистрации) КАК СостоянияРегистрацииСрез"; 
			
	Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	Запрос.УстановитьПараметр("ТипРегистрации", ТипРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();
	
	Возврат Выборка.Состояние;
	
КонецФункции   

Процедура УстановитьКомментарий(Отбор, Комментарий) Экспорт
	
	ОбщегоНазначенияКлиентСервер
	      .ПроверитьПараметр("УстановитьКомментарий",
		                     "Комментарий",
		                     Комментарий,
							 Новый ОписаниеТипов("Строка"));
							 
	ОбщегоНазначенияКлиентСервер
	      .ПроверитьПараметр("УстановитьКомментарий",
		                     "Отбор",
		                     Отбор,
							 Тип("Структура"));

		
	НаборЗаписей = СоздатьНаборЗаписей();
	
	Для Каждого ТекущийОтбор Из Отбор Цикл
		НаборЗаписей
			.Отбор[ТекущийОтбор.Ключ]
			.Установить(ТекущийОтбор.Значение);
	КонецЦикла; 
	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.Комментарий = Комментарий;	
	КонецЦикла;
	НаборЗаписей.Записать();
		
КонецПроцедуры

Функция ТекущееСостояниеПоРегистрации(СсылкаНаРегистрацию, Дата = Неопределено) Экспорт
		
	ТекущиеДанныеСостояния = ТекущиеДанныеСостоянияПоРегистрации(СсылкаНаРегистрацию, Дата);
	
	Возврат ТекущиеДанныеСостояния.Состояние;
		
КонецФункции

Функция ТекущиеДанныеСостоянияПоРегистрации(СсылкаНаРегистрацию, Дата = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Состояние", Перечисления.гкс_СостоянияРегистрации.ПустаяСсылка());
	Результат.Вставить("Комментарий", "");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("ДокументРегистрации", СсылкаНаРегистрацию);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВсеСостояния.Состояние КАК Состояние,
	|	ВсеСостояния.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации.СрезПоследних(&ДатаСреза, ДокументРегистрации = &ДокументРегистрации) КАК
	|		ВсеСостояния";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
			
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

// Получить дату установки указанного состояния для Регистрации.
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - Документ регистрации
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - запрашиваемое состояние
// 
// Возвращаемое значение:
//  Дата - Дата записи в регистр с указанным состоянием или пустая
Функция ПолучитьДатуУстановкиСостоянияПоРегистрации(ДокументРегистрации, Состояние) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	гкс_СостоянияРегистрации.Период КАК ДатаУстановки
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации КАК гкс_СостоянияРегистрации
	|ГДЕ
	|	гкс_СостоянияРегистрации.ДокументРегистрации = &ДокументРегистрации
	|	И гкс_СостоянияРегистрации.Состояние = &Состояние";
	
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	Запрос.УстановитьПараметр("Состояние", Состояние);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Дата(1, 1, 1, 0, 0, 0);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();
	
	Возврат Выборка.ДатаУстановки;		
КонецФункции

Функция ВозможностьИзмененияСтатуса(НаборЗаписей) Экспорт	
	
	Значение = Истина;	
	СтруктураДанных = ПолучитьСостояния(НаборЗаписей);
	
	МенеджерНастройки = РегистрыСведений.гкс_НастройкаПорядкаСостоянийРегистрации;
	ПроверкаНеПройдена = МенеджерНастройки.УстановленПорядокСостоянийРегистрации(СтруктураДанных)				
		И Не МенеджерНастройки.ПроверитьКорректностьПоследовательностиСтатусов(СтруктураДанных);
	
	Если ПроверкаНеПройдена Тогда
			
			ИмяСобытияЖурналРегистрации = НСтр("ru = 'Присвоение нового статуса Регистрации ПЛК.'");
			Ошибка = НСтр("ru = 'Попытка нарушения порядка состояний регистрации: %1.
			|Текущее состояние: %2, Новое состояние: %3'");

			Ошибка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Ошибка, СтруктураДанных.Регистрация, СтруктураДанных.ТекущееСостояние, СтруктураДанных.НовоеСостояние);
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурналРегистрации, УровеньЖурналаРегистрации.Ошибка, , , 
			Ошибка);
			//@skip-warning
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка);
			Значение = Ложь;
					
	КонецЕсли;	
	
	Возврат Значение;
	
КонецФункции

// Возвращает все состояния по документу регистрации
// Параметры:
// ДокументРегистрации - ДокументСсылка.гкс_РегистрацияПЛК
// ВозвращаемоеЗначение
// - Массив
Функция ВсеСостоянияРегистрации(ДокумементРегистрации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокумементРегистрации);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	гкс_СостоянияРегистрации.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.гкс_СостоянияРегистрации КАК гкс_СостоянияРегистрации
	|ГДЕ
	|	гкс_СостоянияРегистрации.ДокументРегистрации = &ДокументРегистрации
	|
	|СГРУППИРОВАТЬ ПО
	|	гкс_СостоянияРегистрации.Состояние";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат
		РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Состояние");
	
КонецФункции	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// возвращает ссылку на документ регистрации для входношо документа
//
// Параметры:
//  Документ  - ДокументСсылка - свсылка на документ                 
//
// Возвращаемое значение:
//   ДокументСсылка.гкс_РегистрацияНаПЛК   - ссылка на документ регистрации
//
Функция ДокументРегистрации(Документ) Экспорт
	
	ТипДокумента = ТипЗнч(Документ);

	Если ТипДокумента = Тип("ДокументСсылка.гкс_Взвешивание") 
		ИЛИ ТипДокумента = Тип("ДокументСсылка.гкс_НаправлениеНаРазгрузку") Тогда
		ДокументРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ДокументРегистрации");

	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.гкс_ЛабораторныйАнализ") Тогда
		ДокументРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "гкс_ДокументРегистрации");

	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.гкс_ФормированиеНомераПробы")
		И Документ.СписокРегистраций.Количество() > 0  Тогда 
		// для единичной пробы ДокументРегистрации всегда один
		ДокументРегистрации = Документ.СписокРегистраций[0].ДокументРегистрации;
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.гкс_РегистрацияНаПЛК") Тогда 
		ДокументРегистрации = Документ;	

	Иначе	
		ДокументРегистрации = Документы.гкс_РегистрацияНаПЛК.ПустаяСсылка();
	КонецЕсли;
	          
	Возврат ДокументРегистрации;
	
КонецФункции

Функция ПолучитьСостояния(Набор) 
	
	Структура = Новый Структура;
	
	Регистрация = Набор.Отбор.ДокументРегистрации.Значение;
	Структура.Вставить("Регистарция", Регистрация); 
	Структура.Вставить("ВидПеревозки", Регистрация.ВидПеревозки); 
	Структура.Вставить("ТипРегистрации", Регистрация.ТипРегистрации); 
	Структура.Вставить("Период", Набор.Отбор.Период.Значение); 
	
	ТекущееСостояние = ТекущееСостояниеПоРегистрации(Регистрация, Структура.Период);
	Структура.Вставить("ТекущееСостояние", ТекущееСостояние);
						
	НовоеСостояние = Неопределено;
	ТочкаМаршрута = Неопределено;

	Таблица = Набор.Выгрузить();
	Если Таблица.Количество() > 0 Тогда
		НовоеСостояние = Таблица[0].Состояние;
		ТочкаМаршрута = Таблица[0].ТочкаМаршрута;
	КонецЕсли;
	
	Структура.Вставить("НовоеСостояние", НовоеСостояние);
	Структура.Вставить("ТочкаМаршрута", ТочкаМаршрута);
	
	Структура.Вставить("ЕстьИзменениеСостояния", 
	                НЕ Структура.НовоеСостояние = Структура.ТекущееСостояние);
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти

#КонецЕсли
